app/views/messages/_main.html.haml

SELECT `messages`.* FROM `messages` WHERE `messages`.`user_id` = 1
---
    .main-content__review
      - current_user.messages.each do |message|
        .write-list