app/views/messages/_side.html.haml

SELECT `categories`.* FROM `categories` INNER JOIN `category_users` ON `categories`.`id` = `category_users`.`category_id` WHERE `category_users`.`user_id` = 1
---
    .first-name__list-name
      - current_user.categories.each do |category|
        .group-block