app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('hthh', '2020-09-26 11:12:58.989270', '2020-09-26 11:12:58.989270')
INSERT INTO `category_users` (`category_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-09-26 11:12:58.991797', '2020-09-26 11:12:58.991797')
---
  def new
    @category = Category.new
    @category.users << current_user

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('新規カテゴリー', '2020-09-26 10:43:56.285693', '2020-09-26 10:43:56.285693')
---
  def create
    @category = Category.new(category_params)
    if @category.save