app/controllers/messages_controller.rb

INSERT INTO `messages` (`name`, `memo`, `category_id`, `user_id`, `created_at`, `updated_at`) VALUES ('jjjjj', 'oooooo', 1, 1, '2020-09-29 11:21:54.993267', '2020-09-29 11:21:54.993267')
---
  def create
    @message = @category.messages.new(message_params)
    if @message.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def set_group
    @category = Category.find(params[:category_id])