app/views/categories/new.html.haml

SELECT `users`.* FROM `users`
---
  = f.text_field :name, class: "SettingGroupForm__input", placeholder: "カテゴリー名を入力してください"
  = f.collection_check_boxes :user_ids, User.all, :id, :name